<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Genymotion and imports into munki.</string>
	<key>Identifier</key>
	<string>com.github.erikng.munki.Genymotion</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Genymobile/Genymotion</string>
		<key>NAME</key>
		<string>Genymotion</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Android Development</string>
			<key>description</key>
			<string>Speed up your development lifecycle with an easy, accessible, and effective testing and collaboration tool.</string>
			<key>developer</key>
			<string>Genymobile</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.erikng.download.Genymotion</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root/Applications/Genymotion.app</string>
				<key>source_path</key>
				<string>%pathname%/Genymotion.app</string>
			</dict>
			<key>Comment</key>
			<string>Copy app from DMG so you can obtain a hash of the genymotion application. Copier cannot use arrays.</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root/Applications/Genymotion Shell.app</string>
				<key>source_path</key>
				<string>%pathname%/Genymotion Shell.app</string>
			</dict>
			<key>Comment</key>
			<string>Copy app from DMG so you can obtain a hash of the genyshell application. Copier cannot use arrays.</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Genymotion.app/Contents/MacOS/genymotion</string>
					<string>/Applications/Genymotion Shell.app/Contents/MacOS/genyshell</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Use processor to obtain hashes.</string>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Merge hashes so following additional_pkginfo does't clobber them.</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/Applications</string>
							<key>source_item</key>
							<string>Genymotion.app</string>
						</dict>
						<dict>
							<key>destination_path</key>
							<string>/Applications</string>
							<key>source_item</key>
							<string>Genymotion Shell.app</string>
						</dict>
					</array>
					<key>version</key>
					<string>%genymotion_version%</string>
				</dict>
			</dict>
			<key>Comment</key>
			<string>Setup munki to extract multiple apps from the dmg and give it the API version since Genymotion hates us.</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Comment</key>
			<string>Now import it all into munki.</string>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Cleanup after ourselves so Nick is happy.</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
