<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version Genymotion.</string>
    <key>Identifier</key>
    <string>com.github.erikng.download.Genymotion</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Genymotion</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GenymotionURLProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CURLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://files2.genymotion.com/genymotion/genymotion-%genymotion_version%/genymotion-%genymotion_version%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Genymotion.app</string>
                <key>requirement</key>
                <string>identifier "com.yourcompany.genymotion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "882G6C96X5"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Genymotion Shell.app</string>
                <key>requirement</key>
                <string>identifier "com.yourcompany.genyshell" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "882G6C96X5"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
