<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Prisma Access Browser.</string>
    <key>Identifier</key>
    <string>com.github.erikng.download.PrismaAccessBrowser</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PrismaAccessBrowser</string>
        <key>APPCAST_URL</key>
        <string>https://bfe078e7921507bb.talon-sec.com/sparkle/PAB/stable-universal/appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%APPCAST_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Prisma Access Browser.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>(identifier "com.talon-sec.Work" or identifier "com.talon-sec.Work.beta" or identifier "com.talon-sec.Work.nightly") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XZMH593AYG</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
