<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Prisma Access Browser release and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.erikng.munki.PrismaAccessBrowser</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PrismaAccessBrowser</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/PaloAltoNetworks/PrismaAccessBrowser</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array/>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Browser</string>
            <key>description</key>
            <string>Prisma Access Browser extends SASE protection seamlessly to every device, bringing unmatched agility, security, and control to your business.</string>
            <key>developer</key>
            <string>Palo Alto Networks</string>
            <key>display_name</key>
            <string>Prisma Access Browser</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.erikng.download.PrismaAccessBrowser</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
